import math

print("Hello World!");

print("Глава 1. Ввод и вывод числовых данных. Оператор присваивания.\n\n")

print("Проcтейшие программы. Арифметические выражения.")

pi = math.pi;
print("\n1.1. PI =", pi);
print("PI(format) = {:.2}".format(pi));
num = input("\n1.3. Введите число: ");
print("Введено число:", int(num));
print("\n1.5. Числа одной строкой:", 1, 13, 49);
a1 = 5; a2 = 7; a3 = 12;
print("\n1.7. Вывод трех произвольных чисел через два пробела:", a1, a2, a3, sep='  ');
print("\n1.9. Два заданных числа столбиком(символ \\n):\n50\n10");
a1 = 3; a2 = 4; a3 = 5; a4 = 6;
print("\n1.11. Вывод четырех произвольных чисел столбиком(параметр 'sep'):", a1, a2, a3, a4, sep='\n');
print("\n1.13. Вывод на эран текста и цифр используя параметры функции 'sep' и 'end':");
print("А)", 2, "кг", "Б)", "a", 1, "В)", "x", "y", sep='\t');
print("", 13, 17, "", 19, "b", "", 5, "y", sep='\t');
print("\n1.14. Записать по правилам языка программирования выражения:")
x = 5
r = 2 * x
print("а) 2 * x = 2 *", x, "=", r)
d = -3
r = abs(d)
print("д) | d | = |", d, "| =", r)
a = 3; b = 4
r = a * math.sqrt(4)
print("к) a * sqrt(b ) =", a, "* sqrt(", b, ") =", r, )
alpha = 0.5; beta = 0.8
r = 3 * math.sin(2 * alpha) * math.cos(2 * beta)
print("л) 3 * sin(3 * alpha) * cos(2 * beta) = 3 * sin(", alpha, ") * cos(", beta, ") =", r)
print("\n1.15. Получить линейную запись следующих выражений:")
x = 3
r = -1 / (x ** 2)
print("а) -1 / (x ^ 2) = -1 / (", x, "^ 2) =", r)
b_t = True

print("Arccos(-1) =", math.acos(-1))

print("\nВычисления по известным формулам.\n")



